package com.xiaoyao.travel;

import com.xiaoyao.travel.common.dao.IndividualityMapper;
import com.xiaoyao.travel.common.entity.Individuality;
import org.junit.Test;
import org.springframework.beans.factory.annotation.Autowired;
import org.springframework.boot.test.context.SpringBootTest;

@SpringBootTest
public class importIndividualTests {

    @Autowired
    private IndividualityMapper individualityMapper;

    String key = "- 自然风光：山川湖海、森林草原、星空秘境、花海梯田\n" +
            "- 人文景观：古镇古村、历史遗迹、文化体验、宗教朝圣\n" +
            "- 城市风情：时尚潮流、美食购物、文艺气息、夜生活\n" +
            "- 休闲度假：温泉spa、海岛度假、乡村别墅、亲子乐园\n" +
            "- 户外探险：徒步登山、极限运动、露营野炊、房车旅行\n" +
            "- 自由行：随心所欲、不受约束、深度体验\n" +
            "- 跟团游：省心省力、无忧无虑、结识朋友\n" +
            "- 自驾游：说走就走、自由自在、沿途风光\n" +
            "- 奢华游：高端享受、顶级服务、尊贵体验\n" +
            "- 背包旅行：轻装简行、经济实惠、贴近自然\n" +
            "- 其他：骑行旅行、徒步旅行、志愿服务、特殊人群旅行\n" +
            "- 浪漫温馨：海岛夕阳、樱花雨、烛光晚餐、爱之宣言\n" +
            "- 刺激冒险：极限挑战、穿越无人区、丛林探险、海底世界\n" +
            "- 新奇体验：黑暗料理、奇特风俗、特色民宿、非遗文化\n" +
            "- 舒适放松：温泉spa、海边度假、瑜伽冥想、森林浴\n" +
            "- 宁静安逸：乡村田园、古镇古村、星空秘境、禅修养生\n" +
            "- 其他：感动难忘、充实饱满、开阔眼界、心灵净化\n";
    String key2 = "- 北海道樱花烂漫之旅：在北海道赏樱，感受浪漫的春日气息。\n" +
            "- 巴厘岛海岛秘境探险：潜入巴厘岛的海底世界，探索神秘的海洋世界。\n" +
            "- 撒哈拉沙漠星空露营：在撒哈拉沙漠露营，仰望浩瀚的星空，感受大自然的壮美。\n"+
            "- 青海湖环湖骑行挑战：骑行环绕青海湖，挑战自我，享受壮丽的自然风光。(情感：挑战自我；地点：青海湖；项目：骑行)\n" +
            "- 云南少数民族文化体验之旅：深入云南少数民族村寨，体验独特的民族文化和风俗习惯。(情感：新奇体验；地点：云南；项目：文化体验)\n" +
            "- 意大利托斯卡纳美食寻访：品尝托斯卡纳的特色美食，感受意大利的饮食文化。(情感：舒适放松；地点：意大利托斯卡纳；项目：美食体验)\n" +
            "- 丽江古城穿越时空之旅：漫步丽江古城，感受古朴的纳西文化。(情感：浪漫温馨；地点：丽江古城)\n" +
            "- 桂林山水风光寻幽之旅：泛舟漓江，欣赏桂林山水。(情感：宁静安逸；地点：桂林)\n" +
            "- 北京故宫历史文化探索之旅：走进故宫，感受中华五千年历史文化的博 大精深。(情感：新奇体验；地点：北京故宫)\n" +
            "- 张家界徒步穿越云雾仙境：在张家界徒步，感受壮丽的自然风光。(地点：张家界；项目：徒步)\n" +
            "- 三亚海岛潜水探索海底世界：在三亚潜水，探索神秘的海底世界。(地点：三亚；项目：潜水)\n" +
            "- 黄山登山挑战自我极限：登上海黄山，感受雄伟壮丽的山川景色。(地点：黄山；项目：登山)\n" +
            "- 独自一人，在青藏高原上进行一场自由行的冒险之旅，感受天高地广的壮阔。(情感：刺激冒险；风格：自由行)\n" +
            "- 和家人一起，参加一次舒适的海岛度假，享受阳光、沙滩和美食。(情感：舒适放松；风格：跟团游)\n" +
            "- 和朋友一起，进行一次自驾游，沿途欣赏风景，感受旅途的乐趣。(情感：新奇体验；风格：自驾游)\n";

    @Test
    public void test() {
        String[] split = key2.split("-");

        for (String str : split) {
            if (str.isEmpty()) {
                continue;
            }
            String target = str.split("：")[1];
            System.out.println("insert into individual values (null,0,null,0,'"+target+"',null,null);");

        }
    }
}
